; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-7-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-5 - location
	p0-6 - location
	p2-3 - location
	p2-5 - location
	p3-6 - location
	p4-0 - location
	p4-2 - location
	p4-6 - location
	p5-1 - location
	p5-3 - location
	p5-4 - location
	p6-7 - location
	p7-2 - location
	p7-3 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s0)
	(at driver3 s3)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s7)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s5)
	(empty truck4)
	(at truck5 s7)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at truck7 s5)
	(empty truck7)
	(at package1 s0)
	(at package2 s6)
	(at package3 s3)
	(at package4 s7)
	(at package5 s0)
	(at package6 s0)
	(at package7 s5)
	(at package8 s5)
	(at package9 s3)
	(at package10 s1)
	(at package11 s4)
	(at package12 s4)
	(at package13 s0)
	(at package14 s0)
	(at package15 s6)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(link s0 s4)
	(link s4 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s6)
	(link s6 s0)
	(link s0 s7)
	(link s7 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s1 s4)
	(link s4 s1)
	(link s1 s7)
	(link s7 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s4)
	(link s4 s2)
	(link s3 s4)
	(link s4 s3)
	(link s3 s7)
	(link s7 s3)
	(link s4 s5)
	(link s5 s4)
	(link s4 s6)
	(link s6 s4)
	(link s5 s1)
	(link s1 s5)
	(link s5 s2)
	(link s2 s5)
	(link s6 s1)
	(link s1 s6)
	(link s6 s5)
	(link s5 s6)
	(link s7 s2)
	(link s2 s7)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s4)
	(at driver3 s3)
	(at truck3 s2)
	(at truck5 s7)
	(at truck6 s5)
	(at truck7 s7)
	(at package1 s5)
	(at package2 s6)
	(at package4 s3)
	(at package5 s2)
	(at package6 s5)
	(at package7 s3)
	(at package8 s3)
	(at package9 s7)
	(at package10 s4)
	(at package11 s5)
	(at package12 s3)
	(at package13 s6)
	(at package14 s6)
	(at package15 s6)
	))


)

; plan
1. (board-truck driver3 s3 truck3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 21
2. (load-truck s0 package6 truck1)
   deleted: (at package6 s0)
   added: (in package6 truck1)
   goals met: 3 of 21
3. (board-truck driver2 s0 truck1)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 3 of 21
4. (load-truck s0 package5 truck1)
   deleted: (at package5 s0)
   added: (in package5 truck1)
   goals met: 3 of 21
5. (drive-truck driver2 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 3 of 21
6. (load-truck s4 package12 truck1)
   deleted: (at package12 s4)
   added: (in package12 truck1)
   goals met: 3 of 21
7. (load-truck s4 package11 truck1)
   deleted: (at package11 s4)
   added: (in package11 truck1)
   goals met: 3 of 21
8. (drive-truck driver2 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 3 of 21
9. (load-truck s5 package8 truck1)
   deleted: (at package8 s5)
   added: (in package8 truck1)
   goals met: 3 of 21
10. (load-truck s5 package7 truck1)
   deleted: (at package7 s5)
   added: (in package7 truck1)
   goals met: 3 of 21
11. (drive-truck driver2 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 3 of 21
12. (load-truck s3 package9 truck3)
   deleted: (at package9 s3)
   added: (in package9 truck3)
   goals met: 3 of 21
13. (drive-truck driver3 s3 s7 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s7)
   goals met: 3 of 21
14. (unload-truck s7 package9 truck3)
   deleted: (in package9 truck3)
   added: (at package9 s7)
   goals met: 4 of 21
15. (drive-truck driver3 s7 s0 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   goals met: 4 of 21
16. (load-truck s0 package14 truck3)
   deleted: (at package14 s0)
   added: (in package14 truck3)
   goals met: 4 of 21
17. (load-truck s0 package13 truck3)
   deleted: (at package13 s0)
   added: (in package13 truck3)
   goals met: 4 of 21
18. (load-truck s0 package1 truck3)
   deleted: (at package1 s0)
   added: (in package1 truck3)
   goals met: 4 of 21
19. (drive-truck driver3 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 4 of 21
20. (load-truck s1 package10 truck3)
   deleted: (at package10 s1)
   added: (in package10 truck3)
   goals met: 4 of 21
21. (drive-truck driver3 s1 s4 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   goals met: 4 of 21
22. (unload-truck s4 package10 truck3)
   deleted: (in package10 truck3)
   added: (at package10 s4)
   goals met: 5 of 21
23. (drive-truck driver3 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 5 of 21
24. (unload-truck s5 package1 truck3)
   deleted: (in package1 truck3)
   added: (at package1 s5)
   goals met: 6 of 21
25. (walk driver1 s6 p4-6)
   deleted: (at driver1 s6)
   added: (at driver1 p4-6)
   goals met: 6 of 21
26. (walk driver1 p4-6 s4)
   deleted: (at driver1 p4-6)
   added: (at driver1 s4)
   goals met: 7 of 21
27. (drive-truck driver2 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 7 of 21
28. (unload-truck s3 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s3)
   goals met: 8 of 21
29. (drive-truck driver2 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 8 of 21
30. (drive-truck driver3 s5 s6 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   goals met: 8 of 21
31. (unload-truck s6 package14 truck3)
   deleted: (in package14 truck3)
   added: (at package14 s6)
   goals met: 9 of 21
32. (drive-truck driver3 s6 s5 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   goals met: 9 of 21
33. (drive-truck driver3 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 10 of 21
34. (drive-truck driver3 s2 s7 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s7)
   goals met: 9 of 21
35. (load-truck s7 package4 truck3)
   deleted: (at package4 s7)
   added: (in package4 truck3)
   goals met: 9 of 21
36. (drive-truck driver3 s7 s3 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s3)
   goals met: 9 of 21
37. (unload-truck s3 package4 truck3)
   deleted: (in package4 truck3)
   added: (at package4 s3)
   goals met: 10 of 21
38. (drive-truck driver3 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 10 of 21
39. (board-truck driver1 s4 truck6)
   deleted: (at driver1 s4) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 9 of 21
40. (drive-truck driver1 s4 s5 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   goals met: 10 of 21
41. (disembark-truck driver1 s5 truck6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s5) (empty truck6)
   goals met: 10 of 21
42. (board-truck driver1 s5 truck7)
   deleted: (at driver1 s5) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 10 of 21
43. (drive-truck driver1 s5 s2 truck7)
   deleted: (at truck7 s5)
   added: (at truck7 s2)
   goals met: 10 of 21
44. (drive-truck driver2 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 10 of 21
45. (unload-truck s5 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s5)
   goals met: 11 of 21
46. (drive-truck driver2 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 11 of 21
47. (drive-truck driver2 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 11 of 21
48. (unload-truck s3 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   goals met: 12 of 21
49. (drive-truck driver2 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 12 of 21
50. (drive-truck driver2 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 12 of 21
51. (unload-truck s2 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   goals met: 13 of 21
52. (drive-truck driver2 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 13 of 21
53. (drive-truck driver2 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 13 of 21
54. (unload-truck s3 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s3)
   goals met: 14 of 21
55. (drive-truck driver2 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 14 of 21
56. (drive-truck driver3 s4 s6 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   goals met: 14 of 21
57. (unload-truck s6 package13 truck3)
   deleted: (in package13 truck3)
   added: (at package13 s6)
   goals met: 15 of 21
58. (drive-truck driver3 s6 s5 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   goals met: 15 of 21
59. (disembark-truck driver2 s4 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 16 of 21
60. (disembark-truck driver3 s5 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s5) (empty truck3)
   goals met: 16 of 21
61. (walk driver3 s5 p5-3)
   deleted: (at driver3 s5)
   added: (at driver3 p5-3)
   goals met: 16 of 21
62. (walk driver3 p5-3 s3)
   deleted: (at driver3 p5-3)
   added: (at driver3 s3)
   goals met: 17 of 21
63. (drive-truck driver1 s2 s5 truck7)
   deleted: (at truck7 s2)
   added: (at truck7 s5)
   goals met: 17 of 21
64. (board-truck driver2 s4 truck1)
   deleted: (at driver2 s4) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 16 of 21
65. (drive-truck driver2 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 16 of 21
66. (unload-truck s5 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s5)
   goals met: 17 of 21
67. (drive-truck driver2 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 17 of 21
68. (disembark-truck driver1 s5 truck7)
   deleted: (driving driver1 truck7)
   added: (at driver1 s5) (empty truck7)
   goals met: 17 of 21
69. (board-truck driver1 s5 truck3)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 17 of 21
70. (drive-truck driver1 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 18 of 21
71. (walk driver3 s3 p5-3)
   deleted: (at driver3 s3)
   added: (at driver3 p5-3)
   goals met: 17 of 21
72. (walk driver3 p5-3 s5)
   deleted: (at driver3 p5-3)
   added: (at driver3 s5)
   goals met: 17 of 21
73. (board-truck driver3 s5 truck7)
   deleted: (at driver3 s5) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 17 of 21
74. (drive-truck driver3 s5 s2 truck7)
   deleted: (at truck7 s5)
   added: (at truck7 s2)
   goals met: 17 of 21
75. (disembark-truck driver3 s2 truck7)
   deleted: (driving driver3 truck7)
   added: (at driver3 s2) (empty truck7)
   goals met: 17 of 21
76. (walk driver3 s2 p2-3)
   deleted: (at driver3 s2)
   added: (at driver3 p2-3)
   goals met: 17 of 21
77. (walk driver3 p2-3 s3)
   deleted: (at driver3 p2-3)
   added: (at driver3 s3)
   goals met: 18 of 21
78. (disembark-truck driver1 s2 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 18 of 21
79. (walk driver1 s2 p4-2)
   deleted: (at driver1 s2)
   added: (at driver1 p4-2)
   goals met: 18 of 21
80. (walk driver1 p4-2 s4)
   deleted: (at driver1 p4-2)
   added: (at driver1 s4)
   goals met: 19 of 21
81. (walk driver3 s3 p2-3)
   deleted: (at driver3 s3)
   added: (at driver3 p2-3)
   goals met: 18 of 21
82. (disembark-truck driver2 s4 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 19 of 21
83. (walk driver3 p2-3 s2)
   deleted: (at driver3 p2-3)
   added: (at driver3 s2)
   goals met: 19 of 21
84. (board-truck driver3 s2 truck7)
   deleted: (at driver3 s2) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 19 of 21
85. (drive-truck driver3 s2 s7 truck7)
   deleted: (at truck7 s2)
   added: (at truck7 s7)
   goals met: 20 of 21
86. (disembark-truck driver3 s7 truck7)
   deleted: (driving driver3 truck7)
   added: (at driver3 s7) (empty truck7)
   goals met: 20 of 21
87. (walk driver3 s7 p7-3)
   deleted: (at driver3 s7)
   added: (at driver3 p7-3)
   goals met: 20 of 21
88. (walk driver3 p7-3 s3)
   deleted: (at driver3 p7-3)
   added: (at driver3 s3)
   goals met: 21 of 21
